Community-PIO-CH32V/framework-wch-noneos-sdk/Peripheral/ch572/inc/CH572SFR.h
// FckLSI = RC_LSI
// Fpll = XT_32MHz * 18.75 = 600MHz
// Fsys = RB_CLK_SYS_MOD==3 ? FckLSI : ( ( RB_CLK_SYS_MOD[0] ? Fpll : XT_32MHz ) / RB_CLK_PLL_DIV )
// default: Fsys = XT_32MHz / RB_CLK_PLL_DIV = 32MHz / 5 = 6.4MHz
//   range: 24~42KHz, 1MHz~16MHz, 18.75MHz~100MHz

/* System: sleep control register */
#define R32_SLEEP_CONTROL   (*((PUINT32V)0x4000100C)) // RWA, sleep control, SAM
#define R8_SLP_CLK_OFF0     (*((PUINT8V)0x4000100C))  // RWA, sleep clock off control byte 0, SAM
#define  RB_SLP_KEYSCAN_WAKE  0x80                    // RWA, enable key_scan waking
#define  RB_SLP_CLK_UART    0x10                      // RWA, set 1 close UART clock
#define  RB_SLP_CLK_CMP     0x02                      // RWA, set 1 close CMP clock
#define  RB_SLP_CLK_TMR     0x01                      // RWA, set 1 close TMR clock
#define R8_SLP_CLK_OFF1     (*((PUINT8V)0x4000100D))  // RWA, sleep clock off control byte 1, SAM
#define  RB_SLP_CLK_BLE     0x80                      // RWA, set 1 close BLE clock
#define  RB_SLP_CLK_USB     0x10                      // RWA, set 1 close USB clock
#define  RB_SLP_CLK_I2C     0x08                      // RWA, set 1 close I2C clock
#define  RB_SLP_CLK_PWMX    0x04                      // RWA, set 1 close PWMx clock
#define  RB_CLK_OFF_AESCCM  0x02                      // RWA, set 1 close AES_CCM clock
#define  RB_SLP_CLK_SPI     0x01                      // RWA, set 1 close SPI clock
#define R8_SLP_WAKE_CTRL    (*((PUINT8V)0x4000100E))  // RWA, wake control, SAM
#define  RB_GPIO_WAKE_MODE  0x80                      // RWA, GPIO wakeup mode: RB_SLP_GPIO_EDGE_MODE=1,1=all edge , RB_SLP_GPIO_EDGE_MODE=0,1=rise edge;0=high level
#define  RB_WAKE_EV_MODE    0x40                      // RWA, event wakeup mode: 0=event keep valid for long time, 1=short pulse event
#define  RB_SLP_BAT_WAKE    0x20                      // RWA, enable BAT waking
#define  RB_SLP_GPIO_WAKE   0x10                      // RWA, enable GPIO waking
#define  RB_SLP_RTC_WAKE    0x08                      // RWA, enable RTC waking
#define  RB_SLP_GPIO_EDGE_MODE    0x04                // RWA, GPIO waking edge select:1=all edge,0=pos edge
#define  RB_SLP_ENC_WAKE    0x02                      // RWA, enable encoder waking
#define  RB_SLP_USB_WAKE    0x01                      // RWA, enable USB waking
#define R8_SLP_POWER_CTRL   (*((PUINT8V)0x4000100F))  // RWA, peripherals power down control, SAM
#define  RB_RAM_RET_LV      0xC0                      // RWA, SRAM retention voltage selection: 00=disable, 01=low power mode 1, 10=low power mode 2, 11=low power mode 3,
#define  RB_SLP_CLK_RAMX    0x10                      // RWA, 1=close main SRAM clock, 0=enable main SRAM clock
#define  RB_WAKE_DLY_MOD    0x07                      // RWA, wakeup wait time selection,FCLK + 48cycle == SCLK
// RB_WAKE_DLY_MOD select wakeup delay
//  000: short time, 3584 cycles+TSUHSE
//  001: short time, 512 cycles+TSUHSE
//  010: short time, 64 cycles+TSUHSE
//  011: short time, 1 cycles+TSUHSE
//  100: long time,  8191 cycles+TSUHSE
//  101: long time,  7168 cycles+TSUHSE
//  110: long time,  6144 cycles+TSUHSE
//  111: long time,  4096 cycles+TSUHSE

/* System: I/O pin configuration register */
#define R16_PIN_ALTERNATE   (*((PUINT16V)0x40001018)) // RW, function pin alternate configuration low word
#define  RB_PIN_DEBUG_EN     0x4000                    // RW, debug interface enable  
#define  RB_PIN_USB_EN      0x2000                    // RW, USB analog I/O enable: 0=analog I/O disable, 1=analog I/O enable  
#define  RB_UDP_PU_EN         0x1000                    // RW, USB UDP internal pullup resistance enable: 0=enable/disable by RB_UC_DEV_PU_EN, 1=enable pullup, replace RB_UC_DEV_PU_EN under sleep mode 
#define  RB_PA_DI_DIS         0x0FFF                    // RW, 1=disable PA input , 0=enable PA input
#define R16_PIN_ALTERNATE_H (*((PUINT16V)0x4000101A)) // RW, function pin alternate configuration high word
#define  RB_25M_EN            0x1000                    // RW, CLK25M OUPUT enable
#define  RB_SPI_CLK            0x0800                    // RW, SPI CLK alternate pin enable
#define  RB_I2C_PIN            0x0600                    // RW, I2C alternate pin enable
#define  RB_SPI_CS            0x0100                    // RW, SPI CS alternate pin enable
#define  RB_TMR_PIN         0x00C0                    // RW, TIMER alternate pin enable
#define  RB_UART_TXD        0x0038                    // RW, TXD alternate pin enable
#define  RB_UART_RXD        0x0007                    // RW, RXD alternate pin enable
#define R16_SLP_WAKE_CFG     (*((PUINT16V)0x4000101E)) // RWA, sleep clock aux register, SAM
#define  RB_ACAUTO_ENABLE   0x0100                    // RWA, 1=enable safe register acess auto off,1=disable safe register acess auto off  
#define  RB_PRECLK_CNT_SEL  0x0060                    // RWA, preclk count value sel,11=2048,101024,01= 512,00=256(actual time value = cnt * Fsys)
#define  RB_PRECLK_CNT_EN   0x0010                    // RWA, 1=need to wait until reach to wait time to release flck when wake up   
#define  RB_OSCCLK_RDY_KEEP 0x0001                    // RWA, 1=force OSC READY when halt sleep , 0= OSC not READY when halt sleep   
#define R8_SLP_CLK_OFF2     (*((PUINT8V)0x4000101D))  // RWA, sleep clock off control byte 2, SAM
#define  RB_CLK_OFF_HCLK    0x10                      // RW, 1=XROM hclk off  
#define  RB_CLK_OFF_DEBUG   0x02                      // RW, 1=2wire debug clk off  
#define  RB_CLK_OFF_XROM    0x01                      // RW, 1=XROM 64M or 600M clk off 
#define R8_LONG_RST_CFG     (*((PUINT8V)0x4000101C))  // RWA, long reset config, SAM
#define  RB_LONG_TIM_SEL    0x06                      // RW, long reset time value selecet 11=32.768ms,10=25.000ms,01=20.000msm,00=15.000ms
#define  RB_LONG_RST_EN     0x01                      // RW, long reset enable

/* System: power management register */
#define R32_POWER_MANAG     (*((PUINT32V)0x40001020)) // RWA, power management register, SAM
#define R16_POWER_PLAN      (*((PUINT16V)0x40001020)) // RWA, power plan before sleep instruction, SAM
#define  RB_PWR_PLAN_EN     0x8000                    // RWA/WZ, power plan enable, auto clear after sleep executed
#define  RB_XT_PRE_EN       0x4000                    // RWA, extern 32MHz HSE early wake up enable, must be used with LSI
#define  RB_PWR_MUST_0      0x2000                    // RWA, must write 0
// #define  RB_XT_PRE_CFG      0x1800                    // RWA, extern 32MHz HSE early wake up time configuration
#define  RB_PWR_LDO5V_EN    0x0100                    // RWA, internal LDO5v enable,1=power by V5,0=power by VDD33 
#define  RB_PWR_SYS_EN      0x80                      // RWA, power for system
#define  RB_MAIN_ACT        0x40                      // RWA, main power chose
#define  RB_PWR_EXTEND      0x08                      // RWA, power retention for USB and BLE
#define  RB_PWR_CORE        0x04                      // RWA, power retention for core and base peripherals
#define  RB_PWR_RAM12K      0x02                      // RWA, power for retention 12KB SRAM
#define  RB_PWR_XROM        0x01                      // RWA, power for flash ROM
#define R16_AUX_POWER_ADJ   (*((PUINT16V)0x40001022))  // RWA, aux power adjust control, SAM
#define  RB_CFG_IVREF       0x0F00                    // RWA, I/V reference config data
#define  RB_ULPLDO_ADJ      0x0007                    // RWA, Ultra-Low-Power LDO voltage adjust

/* System: battery detector register */
#define R32_BATTERY_CTRL    (*((PUINT32V)0x40001024)) // RWA, battery voltage detector, SAM
#define R8_BAT_DET_CTRL     (*((PUINT8V)0x40001024))  // RWA, battery voltage detector control, SAM
#define  RB_BAT_LOW_IE      0x08                      // RWA, interrupt enable for battery low voltage
#define  RB_BAT_MON_EN      0x02                      // RWA, battery voltage monitor enable under sleep mode
#define  RB_PWR_LDO_EN      0x01                      // RWA, enable LDO
// request NMI interrupt if both RB_BAT_LOWER_IE and RB_BAT_LOW_IE enabled
#define R8_BAT_DET_CFG      (*((PUINT8V)0x40001025))  // RWA, battery voltage detector configuration, SAM
#define  RB_BAT_LOW_VTH     0x03                      // RWA, select detector/monitor threshold voltage of battery voltage low
#define R8_BAT_STATUS       (*((PUINT8V)0x40001026))  // RO, battery status
#define  RB_BAT_STAT_LOW    0x02                      // RO, battery low voltage status for detector/monitor, high action

/* System: LSI oscillator control register */
#define R32_OSC_LSI_CTRL     (*((PUINT32V)0x4000102C)) // RWA, LSI oscillator control, SAM
#define R16_INT_LSI_TUNE     (*((PUINT16V)0x4000102C)) // RWA, LSI oscillator tune control, SAM
#define  RB_INT_LSI_TUNE     0x1FFF                    // RWA, LSI oscillator frequency tune
#define R8_LSI_CONFIG       (*((PUINT8V)0x4000102F))   // RWA, LSI oscillator configure
#define  RB_LSI_CLK_PIN     0x80                       // RO, LSI oscillator clock pin status
#define  RB_CLK_LSI_PON  0x01                       // RWA, LSI oscillator power on

/* System: real-time clock register */
#define R32_RTC_CTRL        (*((PUINT32V)0x40001030)) // RWA, RTC control, SAM
#define R8_RTC_FLAG_CTRL    (*((PUINT8V)0x40001030))  // RW, RTC flag and clear control
#define  RB_RTC_TRIG_FLAG   0x80                      // RO, RTC trigger action flag
#define  RB_RTC_TMR_FLAG    0x40                      // RO, RTC timer action flag
#define  RB_RTC_TRIG_CLR    0x20                      // RW, set 1 to clear RTC trigger action flag, auto clear
#define  RB_RTC_TMR_CLR     0x10                      // RW, set 1 to clear RTC timer action flag, auto clear
#define R8_RTC_MODE_CTRL    (*((PUINT8V)0x40001031))  // RWA, RTC mode control, SAM
#define  RB_RTC_LOAD_HI     0x80                      // RWA, set 1 to load RTC count high word R32_RTC_CNT_DAY, auto clear after loaded
#define  RB_RTC_LOAD_LO     0x40                      // RWA, set 1 to load RTC count low word R32_RTC_CNT_LSI, auto clear after loaded
#define  RB_RTC_TRIG_EN     0x20                      // RWA, RTC trigger mode enable
#define  RB_RTC_TMR_EN      0x10                      // RWA, RTC timer mode enable
#define  RB_RTC_IGNORE_B0   0x08                      // RWA, force ignore bit0 for trigger mode: 0=compare bit0, 1=ignore bit0
#define  RB_RTC_TMR_MODE    0x07                      // RWA, RTC timer mode(unit=cycle): 000: 1; 001: 4096; 010: 12288; 011: 28672 ; 100:61440 ;101: 122880 ;110: 245760; 111: 491520
#define R32_RTC_TRIG        (*((PUINT32V)0x40001034)) // RWA, RTC trigger value, SAM
#define R32_RTC_CNT_LSI     (*((PUINT32V)0x40001038)) // RO, RTC count based LSI
#define R16_RTC_CNT_LSI     (*((PUINT16V)0x40001038)) // RO, RTC count based LSI
#define R16_RTC_CNT_DIV1    (*((PUINT16V)0x4000103A)) // RO, RTC count based 65536 frequency division period
#define R32_RTC_CNT_DIV2    (*((PUINT32V)0x4000103C)) // RO, RTC count based 2764800000 frequency division period

