Community-PIO-CH32V/framework-wch-noneos-sdk/Peripheral/ch572/inc/CH572SFR.h
/*System: Miscellaneous Control register */
#define R32_MISC_CTRL       (*((PUINT32V)0x40001048)) // RWA, miscellaneous control register
#define R8_PLL_CONFIG       (*((PUINT8V)0x4000104B))  // RWA, PLL configuration control, SAM
#define  RB_PLL_CFG_DAT     0x7F                      // RWA, PLL configuration control, SAM

/* System: 32MHz oscillator control register */
#define R8_XT32M_TUNE       (*((PUINT8V)0x4000104E))  // RWA, external 32MHz oscillator tune control, SAM
#define  RB_XT32M_C_LOAD    0x70                      // RWA, external 32MHz oscillator load capacitor tune: Cap = RB_XT32M_C_LOAD * 2 + 10pF
#define  RB_XT32M_I_BIAS    0x03                      // RWA, external 32MHz oscillator bias current tune: 00=75% current, 01=standard current, 10=125% current, 11=150% current

/* System: oscillator frequency calibration register */
#define R32_OSC_CALIB       (*((PUINT32V)0x40001050)) // RWA, oscillator frequency calibration, SAM
#define R16_OSC_CAL_CNT     (*((PUINT16V)0x40001050)) // RO, system clock count value for LSI multi-cycles
#define  RB_OSC_CAL_IF      0x8000                    // RW1, interrupt flag for oscillator capture end, set 1 to clear
#define  RB_OSC_CAL_OV_CLR  0x4000                    // RW1, indicate R8_OSC_CAL_OV_CNT not zero, set 1 to clear R8_OSC_CAL_OV_CNT
#define  RB_OSC_CAL_CNT     0x3FFF                    // RO, system clock count value for LSI multi-cycles
#define R8_OSC_CAL_OV_CNT   (*((PUINT8V)0x40001052))  // RO, oscillator frequency calibration overflow times
#define R8_OSC_CAL_CTRL     (*((PUINT8V)0x40001053))  // RWA, oscillator frequency calibration control, SAM
#define  RB_CNT_CLR         0x80                      // RWA,  reset RB_OSC_CAL_CNT
#define  RB_OSC_CNT_END     0x40                      // RWA, select oscillator capture end mode: 0=normal, 1=append 2 cycles
#define  RB_OSC_CNT_EN      0x20                      // RWA, calibration counter enable
#define  RB_OSC_CAL_IE      0x10                      // RWA, interrupt enable for oscillator capture end
#define  RB_OSC_CNT_HALT    0x08                      // RO, calibration counter halt status: 0=counting, 1=halt for reading count value
#define  RB_OSC_CNT_TOTAL   0x07                      // RWA, total cycles mode for oscillator capture
// RB_OSC_CNT_TOTAL: select total cycles for oscillator capture
//    000: 1
//    001: 2
//    010: 4
//    011: 32
//    100: 64
//    101: 128
//    110: 1024
//    111: 2047

/*system: CMP*/
#define R32_CMP_CTRL       (*((PUINT32V)0x40001054)) // RW, configuration for comparator, 
#define R8_CMP_CTRL_0      (*((PUINT8V)0x40001054))  // RW, configuration for comparator0, 
#define  RB_CMP_NREF_LEVEL 0xF0                      // RW, comparator negative end point Vref sel:1111=800mv,0000=50mv       
#define  RB_CMP_SW         0x0C                      // RW, [0]comparator -channel input sel:1=PA7,0=PA3 ; [1]comparator +channel input sel: 1=COMP_VERF,0=PA2
#define  RB_CMP_CAP        0x02                      // RW, connect COMP_output to be TIM_cap1_input
#define  RB_CMP_EN         0x01                      // RW, enable comparators    
#define R8_CMP_CTRL_1      (*((PUINT8V)0x40001055))  // RW, configuration for comparator1, 
#define  RB_CMP_OUT_SEL    0x0C                      // RW, comparator output sel:11=rise edge,10=fall edge,01=low,00=high 
#define  RB_CMP_IE         0x01                      // RW, comparator interupt enable 
#define R8_CMP_CTRL_2      (*((PUINT8V)0x40001056))  // RW, configuration for comparator2, 
#define  RB_CMP_IF         0x01                      // RW1Z, comparator interupt flag     
#define R8_CMP_CTRL_3      (*((PUINT8V)0x40001057))  // RW, configuration for comparator3,
#define  RB_CMP_REAL_SIG   0x01                      // RO, comparator current real siginal 
#define  RB_APR_OUT_CMP    0x02                      // RO, comparator current output siginal 
#define R32_SAFE_ACCESS_SIG2  (*((PUINT32V)0x40001058)) // RO, safe accessing sign register2,
#define  RB_FUN_MODE        0x07000000                // RO, function enable
#define  RB_FLASH_HALTED    0x00800000                // RO, 2wire flash prohibited operation flag,1=prohibit operation; 0=allow operation
#define  RB_MANU_CFG_LOCK   0x00400000                // RO, vendor configuration word lock flag,1=locked; 0= not locked
#define  RB_RD_PROTECT      0x00200000                // RO, flash read protecet flag,1=enable read project; 0=disable read project
#define  RB_SAFE_AC_DIS     0x00100000                // RO, safe register auto disable flag,1=disable safe access auto off; 0=enable safe access auto off


/* System: Flash ROM control register */
#define R32_FLASH_DATA      (*((PUINT32V)0x40001800)) // RO/WO, flash ROM data
#define R32_FLASH_CONTROL   (*((PUINT32V)0x40001804)) // RWA, flash ROM control,byte1 and byte3 need RWA
#define R8_FLASH_DATA       (*((PUINT8V)0x40001804))  // RO/WO, flash ROM data buffer
#define R8_FLASH_SCK        (*((PUINT8V)0x40001805))  // RW, flash ROM sck time config
#define R8_FLASH_CTRL       (*((PUINT8V)0x40001806))  // RW, flash ROM access control
#define R8_FLASH_CFG        (*((PUINT8V)0x40001807))  // RWA, flash ROM access config, SAM

/* System: GPIO interrupt control register */
#define R32_GPIO_INT_EN     (*((PUINT32V)0x40001090)) // RW, GPIO interrupt enable
#define R16_PA_INT_EN       (*((PUINT16V)0x40001090)) // RW, GPIO PA interrupt enable
#define R32_GPIO_INT_MODE   (*((PUINT32V)0x40001094)) // RW, GPIO interrupt mode: 0=level action, 1=edge action
#define R16_PA_INT_MODE     (*((PUINT16V)0x40001094)) // RW, GPIO PA interrupt mode: 0=level action, 1=edge action
#define R16_PA_INT_EDGE_TYPE (*((PUINT16V)0x40001096)) // RW, GPIO interrupt edge mode: 0=according to por, 1= don't according to por	
#define R32_GPIO_INT_IF     (*((PUINT32V)0x4000109C)) // RW1, GPIO interrupt flag
#define R16_PA_INT_IF       (*((PUINT16V)0x4000109C)) // RW1, GPIO PA interrupt flag

/* GPIO PA register */
#define R32_PA_DIR          (*((PUINT32V)0x400010A0)) // RW, GPIO PA I/O direction: 0=in, 1=out
#define R8_PA_DIR_0         (*((PUINT8V)0x400010A0))  // RW, GPIO PA I/O direction byte 0
#define R8_PA_DIR_1         (*((PUINT8V)0x400010A1))  // RW, GPIO PA I/O direction byte 1
#define R32_PA_PIN          (*((PUINT32V)0x400010A4)) // RO, GPIO PA input
#define R8_PA_PIN_0         (*((PUINT8V)0x400010A4))  // RO, GPIO PA input byte 0
#define R8_PA_PIN_1         (*((PUINT8V)0x400010A5))  // RO, GPIO PA input byte 1
#define R32_PA_OUT          (*((PUINT32V)0x400010A8)) // RW, GPIO PA output
#define R8_PA_OUT_0         (*((PUINT8V)0x400010A8))  // RW, GPIO PA output byte 0
#define R8_PA_OUT_1         (*((PUINT8V)0x400010A9))  // RW, GPIO PA output byte 1
#define R32_PA_CLR          (*((PUINT32V)0x400010AC)) // WZ, GPIO PA clear output: 0=keep, 1=clear
#define R8_PA_CLR_0         (*((PUINT8V)0x400010AC))  // WZ, GPIO PA clear output byte 0
#define R8_PA_CLR_1         (*((PUINT8V)0x400010AD))  // WZ, GPIO PA clear output byte 1
#define R32_PA_PU           (*((PUINT32V)0x400010B0)) // RW, GPIO PA pullup resistance enable
#define R8_PA_PU_0          (*((PUINT8V)0x400010B0))  // RW, GPIO PA pullup resistance enable byte 0
#define R8_PA_PU_1          (*((PUINT8V)0x400010B1))  // RW, GPIO PA pullup resistance enable byte 1
#define R32_PA_PD_DRV       (*((PUINT32V)0x400010B4)) // RW, PA pulldown for input or PA driving capability for output
#define R8_PA_PD_DRV_0      (*((PUINT8V)0x400010B4))  // RW, PA pulldown for input or PA driving capability for output byte 0
#define R8_PA_PD_DRV_1      (*((PUINT8V)0x400010B5))  // RW, PA pulldown for input or PA driving capability for output byte 1
#define R32_PA_SET          (*((PUINT32V)0x400010B8)) // WZ, PA set high for output ,1=set output high,0=IDLE
/* KEYSCAN register */
#define R16_KEY_SCAN_CTRL    (*((PUINT16V)0x40001064))// KEY SCAN control register
#define  RB_CLR_WAKEUP_EN   0x4000                   // RW, claer wake_up siginal after chip wakeing up, 1=enable 0=disable 
#define  RB_SCAN_1END_WAKE_EN    0x2000              // RW, wake up chip after 1 round of key scanning, 1=enable 0=disable 
#define  RB_PIN_SCAN_EN     0x1F00                   // RW, select which pin could be scaned, 1=enable 0=disable
#define  RB_SCAN_CLK_DIV    0x00F0                   // RW, divider value of scanning clock
#define  RB_SCAN_CNT_END    0x000E                   // RW, set the times of the same key_scan value 
#define  RB_SCAN_START_EN   0x0001                   // RW, start key scan enable,1=enable 0=disable
#define R8_KEY_SCAN_INT_EN (*((PUINT8V)0x40001066))  // KEY SCAN interupt enable register
#define  RB_SCAN_1END_IE    0x02                     // RW, key scan 1 round end interupt enable
#define  RB_KEY_PRESSED_IE  0x01                     // RW, detect key pressed interupt enable                  
#define R8_KEY_SCAN_INT_FLAG (*((PUINT8V)0x40001067))// KEY SCAN interupt flag register 
#define  RB_SCAN_1END_IF    0x02                     // RW1, key scan 1 round end flag enable
#define  RB_KEY_PRESSED_IF  0x01                     // RW1, detect key pressed flag enable                   
#define R32_KEY_SCAN_NUMB  (*((PUINT32V)0x40001068))// SCAN_KEY number address now register
#define  RB_KEY_SCAN_CNT    0x700000                 // current SCAN_KEY times
#define  RB_KEY_SCAN_NUMB   0x0FFFFF                 // SCAN_KEY number address now 

/* GPIO register address offset and bit define */
#define BA_PA               ((PUINT8V)0x400010A0)     // point GPIO PA base address
#define GPIO_DIR            0x00
#define GPIO_DIR_0          0x00
#define GPIO_DIR_1          0x01
#define GPIO_PIN            0x04
#define GPIO_PIN_0          0x04
#define GPIO_PIN_1          0x05
#define GPIO_OUT            0x08
#define GPIO_OUT_0          0x08
#define GPIO_OUT_1          0x09
#define GPIO_CLR            0x0C
#define GPIO_CLR_0          0x0C
#define GPIO_CLR_1          0x0D
#define GPIO_PU             0x10
#define GPIO_PU_0           0x10
#define GPIO_PU_1           0x11
#define GPIO_PD_DRV         0x14
#define GPIO_PD_DRV_0       0x14
#define GPIO_PD_DRV_1       0x15

/* GPIO alias name */
#define bTIO            (1<<0)          //PA0
#define bTXD_3          (1<<0)          //PA0
#define bRXD_2          (1<<0)          //PA0
#define bSCL_1          (1<<0)          //PA0
#define bUDM            (1<<0)          //PA0

#define bTCK            (1<<1)          //PA1
#define bTXD_2          (1<<1)          //PA1
#define bRXD_3          (1<<1)          //PA1
#define bSDA_1          (1<<1)          //PA1
#define bUDP            (1<<1)          //PA1

#define bTXD_1          (1<<2)          //PA2
#define bRXD_0          (1<<2)          //PA2
#define bSDA_2          (1<<2)          //PA2
#define bPWM2           (1<<2)          //PA2    
#define bPWM0_1         (1<<2)          //PA2    
#define bCAP1_1         (1<<2)          //PA2
#define bCAP2_0         (1<<2)          //PA2
#define bSCS_           (1<<2)          //PA2
#define bKEY0           (1<<2)          //PA2
#define bCMP0           (1<<2)          //PA2

#define bTXD_0          (1<<3)          //PA3
#define bRXD_1          (1<<3)          //PA3
#define bSCL_2          (1<<3)          //PA3
#define bPWM3           (1<<3)          //PA3    
#define bSCK_           (1<<3)          //PA3
#define bKEY1           (1<<3)          //PA3
#define bCMP1           (1<<3)          //PA3

#define bPWM4           (1<<4)          //PA4    
#define bPWM0_2         (1<<4)          //PA4    
#define bSCS            (1<<4)          //PA4
#define bCAP1_2         (1<<4)          //PA4
#define bCAP2_3         (1<<4)          //PA4
#define bXM25MO         (1<<4)          //PA4

