Community-PIO-CH32V/framework-wch-noneos-sdk/Peripheral/ch572/inc/CH572SFR.h
#define bSCL_3          (1<<5)          //PA5
#define bSCK            (1<<5)          //PA5

#define bSDA_6          (1<<6)          //PA6
#define bMISO           (1<<6)          //PA6
#define bRXD_4          (1<<6)          //PA6

#define bTXD_4          (1<<7)          //PA7
#define bMOSI           (1<<7)          //PA7
#define bPWM1           (1<<7)          //PA7    
#define bPWM0_0         (1<<7)          //PA7    
#define bRST_           (1<<7)          //PA7
#define bCAP1_0         (1<<7)          //PA7
#define bCAP2_1         (1<<7)          //PA7
#define bCMP2           (1<<7)          //PA7

#define bRST            (1<<8)          //PA8
#define bTXD_5          (1<<8)          //PA8
#define bSCL_0          (1<<8)          //PA8
#define bPWM5           (1<<8)          //PA8    
#define bKEY2           (1<<8)          //PA8

#define bSDA_0          (1<<9)          //PA9
#define bPWM0_3         (1<<9)          //PA9    
#define bRXD_5          (1<<9)          //PA9
#define bCAP1_3         (1<<9)          //PA9
#define bCAP2_2         (1<<9)          //PA9

#define bTXD_7          (1<<10)         //PA10
#define bRXD_6          (1<<10)         //PA10
#define bKEY3           (1<<10)         //PA10

#define bTXD_6          (1<<11)         //PA11
#define bRXD_7          (1<<11)         //PA11
#define bKEY4           (1<<11)         //PA11

/* Timer1 register */
#define R32_TMR_CONTROL    (*((PUINT32V)0x40002400)) // RW, TMR control
#define R8_TMR_CTRL_MOD    (*((PUINT8V)0x40002400))  // RW, TMR mode control
#define R8_TMR_CTRL_DMA    (*((PUINT8V)0x40002401))  // RW, TMR DMA control
#define R8_TMR_INTER_EN    (*((PUINT8V)0x40002402))  // RW, TMR interrupt enable
// #define R32_TMR_STATUS     (*((PUINT32V)0x40002404)) // RW, TMR status
#define R8_TMR_INT_FLAG    (*((PUINT8V)0x40002406))  // RW1, TMR interrupt flag
#define R8_TMR_FIFO_COUNT  (*((PUINT8V)0x40002407))  // RO, TMR FIFO count status
#define R32_TMR_COUNT      (*((PUINT32V)0x40002408)) // RO, TMR current count
#define R16_TMR_COUNT      (*((PUINT16V)0x40002408)) // RO, TMR current count
#define R8_TMR_COUNT       (*((PUINT8V)0x40002408))  // RO, TMR current count
#define R32_TMR_CNT_END    (*((PUINT32V)0x4000240C)) // RW, TMR end count value, only low 26 bit
#define R32_TMR_FIFO       (*((PUINT32V)0x40002410)) // RO/WO, TMR FIFO register, only low 26 bit
#define R16_TMR_FIFO       (*((PUINT16V)0x40002410)) // RO/WO, TMR FIFO register
#define R8_TMR_FIFO        (*((PUINT8V)0x40002410))  // RO/WO, TMR FIFO register
#define R32_TMR_DMA_NOW    (*((PUINT32V)0x40002414)) // RW, TMR DMA current address
#define R16_TMR_DMA_NOW    (*((PUINT16V)0x40002414)) // RW, TMR DMA current address
#define R32_TMR_DMA_BEG    (*((PUINT32V)0x40002418)) // RW, TMR DMA begin address
#define R16_TMR_DMA_BEG    (*((PUINT16V)0x40002418)) // RW, TMR DMA begin address
#define R32_TMR_DMA_END    (*((PUINT32V)0x4000241C)) // RW, TMR DMA end address
#define R16_TMR_DMA_END    (*((PUINT16V)0x4000241C)) // RW, TMR DMA end address
/* ENCODER register */
#define R32_ENC_REG_CTRL    (*((PUINT32V)0x40002420))
#define R8_ENC_REG_CTRL        (*((PUINT8V)0x40002420))  // RW, ENCODER control register
// #define  RB_WAKEUP_CLR_EN   0x10                      // RW, clear wake_up siginal after chip wake up enable   
#define  RB_ENC_DIR         0x20                      // RO, encoder director,0=forward,1=backward  
#define  RB_RD_CLR_EN       0x08                      // RW, clear encoder count value after R32_ENC_REG_CCNT be read
#define  RB_SMS_MODE        0x06                      // RW, SMS mode value,10=T1EDGE,01=T2EDGE,11=T12EDGE
#define  RB_START_ENC_EN    0x01                      // RW, start encode enable   
#define R8_ENC_INTER_EN        (*((PUINT8V)0x40002421))  // RW, ENCODER interupt enable register
#define  RB_IE_DIR_DEC      0x02                      // RW, encode decrease interupt enable
#define  RB_IE_DIR_INC      0x01                      // RW, encode increase interupt enable 
#define R8_ENC_INT_FLAG        (*((PUINT8V)0x40002422))  // RW, ENCODER interupt flag register
#define  RB_IF_DIR_DEC      0x02                      // RWA, encode decrease interupt flag
#define  RB_IF_DIR_INC      0x01                      // RWA, encode increase interupt flag 
#define R32_ENC_REG_CEND    (*((PUINT32V)0x40002424))
#define R32_ENC_REG_CCNT    (*((PUINT32V)0x40002428))

/* Timer register address offset and bit define */
#define TMR_FIFO_SIZE       8                         // timer FIFO size (depth)
#define BA_TMR             ((PUINT8V)0x40002400)     // point TMR base address
#define TMR_CTRL_MOD        0
#define  RB_TMR_PWM_REPEAT  0xC0                      // RW, timer PWM repeat mode: 00=1, 01=4, 10=8, 11-16
#define  RB_TMR_CAP_EDGE    0xC0                      // RW, timer capture edge mode: 00=disable, 01=edge change, 10=fall to fall, 11-rise to rise
#define  RB_TMR_OUT_POLAR   0x10                      // RW, timer PWM output polarity: 0=default low and high action, 1=default high and low action
#define  RB_TMR_CAP_COUNT   0x10                      // RW, count sub-mode if RB_TMR_MODE_IN=1: 0=capture, 1=count
#define  RB_TMR_OUT_EN      0x08                      // RW, timer output enable
#define  RB_TMR_COUNT_EN    0x04                      // RW, timer count enable
#define  RB_TMR_ALL_CLEAR   0x02                      // RW, force clear timer FIFO and count
#define  RB_TMR_MODE_IN     0x01                      // RW, timer in mode: 0=timer/PWM, 1=capture/count
#define TMR_CTRL_DMA        1
#define  RB_TMR_DMA_LOOP    0x04                      // RW, timer1/2 DMA address loop enable
#define  RB_TMR_DMA_ENABLE  0x01                      // RW, timer1/2 DMA enable
#define TMR_INTER_EN        2
#define  RB_TMR_IE_FIFO_OV  0x10                      // RW, enable interrupt for timer FIFO overflow
#define  RB_TMR_IE_DMA_END  0x08                      // RW, enable interrupt for timer1/2 DMA completion
#define  RB_TMR_IE_FIFO_HF  0x04                      // RW, enable interrupt for timer FIFO half (capture fifo >=4 or PWM fifo <=3)
#define  RB_TMR_IE_DATA_ACT 0x02                      // RW, enable interrupt for timer capture input action or PWM trigger
#define  RB_TMR_IE_CYC_END  0x01                      // RW, enable interrupt for timer capture count timeout or PWM cycle end
#define TMR_INT_FLAG        6
#define  RB_TMR_IF_FIFO_OV  0x10                      // RW1, interrupt flag for timer FIFO overflow
#define  RB_TMR_IF_DMA_END  0x08                      // RW1, interrupt flag for timer1/2 DMA completion
#define  RB_TMR_IF_FIFO_HF  0x04                      // RW1, interrupt flag for timer FIFO half (capture fifo >=4 or PWM fifo <=3)
#define  RB_TMR_IF_DATA_ACT 0x02                      // RW1, interrupt flag for timer capture input action or PWM trigger
#define  RB_TMR_IF_CYC_END  0x01                      // RW1, interrupt flag for timer capture count timeout or PWM cycle end
#define TMR_FIFO_COUNT      7
#define TMR_DMA_END         0x1C
#define TMR_DMA_BEG         0x18
#define TMR_DMA_NOW         0x14
#define TMR_FIFO            0x10
#define TMR_CNT_END         0x0C
#define TMR_COUNT           0x08

/* UART register */
#define R32_UART_CTRL      (*((PUINT32V)0x40003400)) // RW, UART control
#define R8_UART_MCR        (*((PUINT8V)0x40003400))  // RW, UART modem control
#define R8_UART_IER        (*((PUINT8V)0x40003401))  // RW, UART interrupt enable
#define R8_UART_FCR        (*((PUINT8V)0x40003402))  // RW, UART FIFO control
#define R8_UART_LCR        (*((PUINT8V)0x40003403))  // RW, UART line control
#define R8_UART_IIR        (*((PUINT8V)0x40003404))  // RO, UART interrupt identification
#define R8_UART_LSR        (*((PUINT8V)0x40003405))  // RO, UART line status
#define R8_UART_RBR        (*((PUINT8V)0x40003408))  // RO, UART receiver buffer, receiving byte
#define R8_UART_THR        (*((PUINT8V)0x40003408))  // WO, UART transmitter holding, transmittal byte
#define R8_UART_RFC        (*((PUINT8V)0x4000340A))  // RO, UART receiver FIFO count
#define R8_UART_TFC        (*((PUINT8V)0x4000340B))  // RO, UART transmitter FIFO count
#define R16_UART_DL        (*((PUINT16V)0x4000340C)) // RW, UART divisor latch
#define R8_UART_DLL        (*((PUINT8V)0x4000340C))  // RW, UART divisor latch LSB byte
#define R8_UART_DLM        (*((PUINT8V)0x4000340D))  // RW, UART divisor latch MSB byte
#define R8_UART_DIV        (*((PUINT8V)0x4000340E))  // RW, UART pre-divisor latch byte, only low 7 bit, from 1 to 0/128

/* UART register address offset and bit define */
#define UART_FIFO_SIZE      8                         // UART FIFO size (depth)
#define UART_RECV_RDY_SZ    7                         // the max FIFO trigger level for UART receiver data available
#define BA_UART            ((PUINT8V)0x40003400)     // point UART base address
#define UART_MCR            0
#define  RB_MCR_OUT2        0x08                      // RW, UART control OUT2
#define  RB_MCR_INT_OE      0x08                      // RW, UART interrupt output enable
#define UART_IER            1
#define  RB_IER_TXD_EN      0x40                      // RW, UART TXD pin enable
#define  RB_IER_LINE_STAT   0x04                      // RW, UART interrupt enable for receiver line status
#define  RB_IER_THR_EMPTY   0x02                      // RW, UART interrupt enable for THR empty
#define  RB_IER_RECV_RDY    0x01                      // RW, UART interrupt enable for receiver data ready
#define UART_FCR            2
#define  RB_FCR_FIFO_TRIG   0xC0                      // RW, UART receiver FIFO trigger level: 00-1byte, 01-2bytes, 10-4bytes, 11-7bytes
#define  RB_FCR_FIFO_EN     0x01                      // RW, UART FIFO enable
#define UART_LCR            3
#define  RB_LCR_DLAB        0x80                      // RW, UART reserved bit
#define  RB_LCR_GP_BIT      0x80                      // RW, UART general purpose bit
#define  RB_LCR_BREAK_EN    0x40                      // RW, UART break control enable
#define  RB_LCR_PAR_MOD     0x30                      // RW, UART parity mode: 00-odd, 01-even, 10-mark, 11-space
#define  RB_LCR_PAR_EN      0x08                      // RW, UART parity enable
#define  RB_LCR_STOP_BIT    0x04                      // RW, UART stop bit length: 0-1bit, 1-2bit
#define  RB_LCR_WORD_SZ     0x03                      // RW, UART word bit length: 00-5bit, 01-6bit, 10-7bit, 11-8bit
#define UART_IIR            4
#define  RB_IIR_FIFO_ID     0xC0                      // RO, UART FIFO enabled flag
#define  RB_IIR_INT_MASK    0x0F                      // RO, UART interrupt flag bit mask
#define  RB_IIR_NO_INT      0x01                      // RO, UART no interrupt flag: 0=interrupt action, 1=no interrupt
#define UART_LSR            5
#define  RB_LSR_ERR_RX_FIFO 0x80                      // RO, indicate error in UART receiver fifo
#define  RB_LSR_TX_ALL_EMP  0x40                      // RO, UART transmitter all empty status
#define  RB_LSR_TX_FIFO_EMP 0x20                      // RO, UART transmitter fifo empty status
#define  RB_LSR_BREAK_ERR   0x10                      // RZ, UART receiver break error
#define  RB_LSR_FRAME_ERR   0x08                      // RZ, UART receiver frame error
#define  RB_LSR_PAR_ERR     0x04                      // RZ, UART receiver parity error
#define  RB_LSR_OVER_ERR    0x02                      // RZ, UART receiver overrun error
#define  RB_LSR_DATA_RDY    0x01                      // RO, UART receiver fifo data ready status
#define UART_MSR            6
#define UART_RBR            8
#define UART_THR            8
#define UART_RFC            0x0A
#define UART_TFC            0x0B
#define UART_DLL            0x0C
// #define UART_DLM            0x0D
#define UART_DIV            0x0E
#define UART_ADR            0x0F

/* UART interrupt identification values for IIR bits 3:0 */
#define UART_II_RECV_TOUT   0x0C                      // RO, UART interrupt by receiver fifo timeout
#define UART_II_LINE_STAT   0x06                      // RO, UART interrupt by receiver line status
#define UART_II_RECV_RDY    0x04                      // RO, UART interrupt by receiver data available
#define UART_II_THR_EMPTY   0x02                      // RO, UART interrupt by THR empty
#define UART_II_NO_INTER    0x01                      // RO, no UART interrupt is pending

/* SPI register */
#define R32_SPI_CONTROL    (*((PUINT32V)0x40004000)) // RW, SPI control
#define R8_SPI_CTRL_MOD    (*((PUINT8V)0x40004000))  // RW, SPI mode control
#define R8_SPI_CTRL_CFG    (*((PUINT8V)0x40004001))  // RW, SPI configuration control
#define R8_SPI_INTER_EN    (*((PUINT8V)0x40004002))  // RW, SPI interrupt enable
#define R8_SPI_CLOCK_DIV   (*((PUINT8V)0x40004003))  // RW, SPI master clock divisor
#define R8_SPI_SLAVE_PRE   (*((PUINT8V)0x40004003))  // RW, SPI slave preset value
#define R32_SPI_STATUS     (*((PUINT32V)0x40004004)) // RW, SPI status
#define R8_SPI_BUFFER      (*((PUINT8V)0x40004004))  // RO, SPI data buffer
#define R8_SPI_RUN_FLAG    (*((PUINT8V)0x40004005))  // RO, SPI work flag
#define R8_SPI_INT_FLAG    (*((PUINT8V)0x40004006))  // RW1, SPI interrupt flag
#define R8_SPI_FIFO_COUNT  (*((PUINT8V)0x40004007))  // RO, SPI FIFO count status
#define R32_SPI_INTER_CFG1 (*((PUINT32V)0x40004008))  // RO, SPI interrupt configuration1
#define R16_SPI_TOTAL_CNT  (*((PUINT16V)0x4000400C)) // RW, SPI total byte count, only low 12 bit
#define R32_SPI_FIFO       (*((PUINT32V)0x40004010)) // RW, SPI FIFO register
#define R8_SPI_FIFO        (*((PUINT8V)0x40004010))  // RO/WO, SPI FIFO register
#define R8_SPI_FIFO_COUNT1 (*((PUINT8V)0x40004013))  // RO, SPI FIFO count status
#define R16_SPI_DMA_NOW    (*((PUINT16V)0x40004014)) // RW, SPI DMA current address
#define R16_SPI_DMA_BEG    (*((PUINT16V)0x40004018)) // RW, SPI DMA begin address
#define R16_SPI_DMA_END    (*((PUINT16V)0x4000401C)) // RW, SPI DMA end address

/* SPI register address offset and bit define */
#define SPI_FIFO_SIZE       8                         // SPI FIFO size (depth)
#define BA_SPI             ((PUINT8V)0x40004000)     // point SPI base address
#define SPI_CTRL_MOD        0
#define  RB_SPI_MISO_OE     0x80                      // RW, SPI MISO output enable
#define  RB_SPI_MOSI_OE     0x40                      // RW, SPI MOSI output enable
#define  RB_SPI_SCK_OE      0x20                      // RW, SPI SCK output enable
#define  RB_SPI_FIFO_DIR    0x10                      // RW, SPI FIFO direction: 0=out(write @master mode), 1=in(read @master mode)
#define  RB_SPI_SLV_CMD_MOD 0x08                      // RW, SPI slave command mode: 0=byte stream, 1=first byte command
#define  RB_SPI_MST_SCK_MOD 0x08                      // RW, SPI master clock mode: 0=mode 0, 1=mode 3
#define  RB_SPI_2WIRE_MOD   0x04                      // RW, SPI enable 2 wire mode for slave: 0=3wire(SCK0,MOSI,MISO), 1=2wire(SCK0,MISO=MXSX)
#define  RB_SPI_ALL_CLEAR   0x02                      // RW, force clear SPI FIFO and count
#define  RB_SPI_MODE_SLAVE  0x01                      // RW, SPI slave mode: 0=master/host, 1=slave/device
#define SPI_CTRL_CFG        1
#define  RB_SPI_MST_DLY_EN  0x40                      // RW, SPI master input delay enable
#define  RB_SPI_BIT_ORDER   0x20                      // RW, SPI bit data order: 0=MSB first, 1=LSB first
#define  RB_SPI_AUTO_IF     0x10                      // RW, enable buffer/FIFO accessing to auto clear RB_SPI_IF_BYTE_END interrupt flag
#define  RB_SPI_DMA_LOOP    0x04                      // RW, SPI DMA address loop enable
#define  RB_MST_CLK_SEL     0x02                      // RW, hclk polarity reversal,1= polarity reversal,0=IDLE 
#define  RB_SPI_DMA_ENABLE  0x01                      // RW, SPI DMA enable
#define SPI_INTER_EN        2
#define  RB_SPI_IE_FST_BYTE 0x80                      // RW, enable interrupt for SPI slave mode first byte received
#define  RB_SPI_IE_FIFO_OV  0x10                      // RW, enable interrupt for SPI FIFO overflow
#define  RB_SPI_IE_DMA_END  0x08                      // RW, enable interrupt for SPI DMA completion
#define  RB_SPI_IE_FIFO_HF  0x04                      // RW, enable interrupt for SPI FIFO half
#define  RB_SPI_IE_BYTE_END 0x02                      // RW, enable interrupt for SPI byte exchanged
#define  RB_SPI_IE_CNT_END  0x01                      // RW, enable interrupt for SPI total byte count end
#define SPI_CLOCK_DIV       3
#define SPI_SLAVE_PRESET    3
#define SPI_BUFFER          4
#define SPI_RUN_FLAG        5
#define  RB_SPI_SLV_SELECT  0x80                      // RO, SPI slave selection status
#define  RB_SPI_SLV_CS_LOAD 0x40                      // RO, SPI slave chip-select loading status
#define  RB_SPI_FIFO_READY  0x20                      // RO, SPI FIFO ready status
#define  RB_SPI_SLV_CMD_ACT 0x10                      // RO, SPI slave first byte / command flag
#define SPI_INT_FLAG        6
#define  RB_SPI_IF_FST_BYTE 0x80                      // RW1, interrupt flag for SPI slave mode first byte received
#define  RB_SPI_FREE        0x40                      // RO, current SPI free status
#define  RB_SPI_IF_FIFO_OV  0x10                      // RW1, interrupt flag for SPI FIFO overflow
#define  RB_SPI_IF_DMA_END  0x08                      // RW1, interrupt flag for SPI DMA completion
#define  RB_SPI_IF_FIFO_HF  0x04                      // RW1, interrupt flag for SPI FIFO half (RB_SPI_FIFO_DIR ? >=4bytes : <4bytes)
#define  RB_SPI_IF_BYTE_END 0x02                      // RW1, interrupt flag for SPI byte exchanged
#define  RB_SPI_IF_CNT_END  0x01                      // RW1, interrupt flag for SPI total byte count end
#define SPI_FIFO_COUNT      7
#define SPI_INTER_CFG1      8
#define  RB_SPI_IF_FIFO_FULL   0x020000               // RW, fifo full interupt flag    
#define  RB_SPI_IF_FIFO_EMPTY  0x010000               // RW, fifo empty interupt flag   
#define  RB_SPI_IE_FIFO_FULL   0x0200                 // RW, fifo full interupt enable    
#define  RB_SPI_IE_FIFO_EMPTY  0x0100                 // RW, fifo empty interupt enable  
#define  RB_SPI_INT_TYPE       0x001F                 // RW, interupt trig mode select,1=edge,0=level  
#define SPI_TOTAL_CNT       0x0C
#define SPI_FIFO            0x10
#define SPI_DMA_NOW         0x14
#define SPI_DMA_BEG         0x18

