Community-PIO-CH32V/framework-wch-noneos-sdk/Peripheral/ch572/inc/CH572SFR.h
/* PWM1/2/3/4/5 register address offset and bit define */
#define BA_PWMX             ((PUINT8V)0x40005000)     // point PWM1/2/3/4/5 base address
#define PWM_OUT_EN          0
#define  RB_PWM5_OUT_EN     0x10                      // RW, PWM5 output enable
#define  RB_PWM4_OUT_EN     0x08                      // RW, PWM4 output enable
#define  RB_PWM3_OUT_EN     0x04                      // RW, PWM3 output enable
#define  RB_PWM2_OUT_EN     0x02                      // RW, PWM2 output enable
#define  RB_PWM1_OUT_EN     0x01                      // RW, PWM1 output enable
#define PWM_POLAR           1
#define  RB_PWM5_POLAR      0x10                      // RW, PWM5 output polarity: 0=default low and high action, 1=default high and low action
#define  RB_PWM4_POLAR      0x08                      // RW, PWM4 output polarity: 0=default low and high action, 1=default high and low action
#define  RB_PWM3_POLAR      0x04                      // RW, PWM3 output polarity: 0=default low and high action, 1=default high and low action
#define  RB_PWM2_POLAR      0x02                      // RW, PWM2 output polarity: 0=default low and high action, 1=default high and low action
#define  RB_PWM1_POLAR      0x01                      // RW, PWM1 output polarity: 0=default low and high action, 1=default high and low action
#define PWM_CONFIG          2
#define  RB_PWM_SYNC_EN     0x80                      // RW, enable sync
#define  RB_PWM_SYNC_START  0x40                      // RW, enable sync start when RB_PWM_SYN_EN=1
#define  RB_PWM4_5_CH       0x10                      // RO, 1=PWM4 channel output 0=PWM5 channel output
#define  RB_PWM4_5_STAG_EN  0x08                      // RW, PWM4/5 stagger output enable: 0=independent output, 1=stagger output
#define  RB_PWM_CYC_MOD     0x06                      // RW, PWM data width mode: 00=8 bits data, 01=7 bits data, 10=6 bits data, 11=16 bits data
#define  RB_PWM_CYCLE_SEL   0x01                      // RW, PWM cycle selection: 0=256/128/64/32 clocks, 1=255/127/63/31 clocks
#define PWM_DMA_CTRL        3
#define  RB_DMA_SEL         0x04                      // RW, RB_PWM_SYN_EN=0: 1=DMA choose 1/2/3 channel output , 0=DMA choose 4/5 channel output ,RB_PWM_SYN_EN=1:  1=DMA choose 1/2/3/4/5 channel output
#define  RB_DMA_ADDR_LOOP   0x02                      // RW, DMA mode:1=DMA loop,0=DMA no loop  
#define  RB_DMA_ENABLE      0x01                      // RW, DMA enable(only 16bit data)  

#define PWM1_DATA_HOLD      4
#define PWM2_DATA_HOLD      5
#define PWM3_DATA_HOLD      6
#define PWM4_DATA_HOLD      7
#define PWM5_DATA_HOLD      8

/* Address space define */
#define BA_CODE             ((PUINT32)0x00000000)     // point code base address
#define SZ_CODE             0x00080000                // code size
#define BA_SFR              ((PUINT32)0x40000000)     // point SFR base address
#define SZ_SFR              0x00010000                // SFR size
#define BA_RAM              ((PUINT32)0x20000000)     // point RAM base address
#define SZ_RAM              0x00003000                // RAM size

/* Special Program Space */
#define CODE_FLASH_SIZE     0x00000                    // size of Data-Flash
#define BOOT_LOAD_ADDR      0x3C000                   // start address of boot loader program
#define BOOT_LOAD_SIZE      0x2000                    // size of boot loader program
#define BOOT_LOAD_CFG       0x3E000                   // start address of configuration information for boot loader program
#define ROM_CFG_ADDR        0x3F000                   // chip configuration information address

/*----- Reference Information --------------------------------------------*/
#define ID_CH572            0x72                      // chip ID
#define ID_CH570            0x70                      // chip ID

/* Interrupt routine address and interrupt number */
// #define INT_ID_TMR0         0                         // interrupt number for Timer0
#define INT_ID_GPIO_A       17                        // interrupt number for GPIO port A
#define INT_ID_SPI          19                        // interrupt number for SPI
#define INT_ID_BLEB         20                        // interrupt number for BLEBB
#define INT_ID_BLEL         21                        // interrupt number for BLELLE
#define INT_ID_USB          22                        // interrupt number for USB
#define INT_ID_TMR          24                        // interrupt number for Timer
#define INT_ID_UART         27                        // interrupt number for UART
#define INT_ID_RTC          28                        // interrupt number for RTC
#define INT_ID_CMP          29      
#define INT_ID_I2C          30      
#define INT_ID_PWMX         31                        // interrupt number for PWM1~5
#define INT_ID_KEYSCAN      33                        // interrupt number for KEYSCAN  
#define INT_ID_ENCODE       34                        // interrupt number for ENCODER  
#define INT_ID_WDOG_BAT     35                        // interrupt number for Watch-Dog timer and Battery low voltage
#define INT_VEC_ENTRY_SZ    4                         // size of each interrupt vector entry
// #define INT_ADDR_TMR0       (INT_ID_TMR0*INT_VEC_ENTRY_SZ+64)    // interrupt vector address for Timer0
#define INT_ADDR_GPIO_A     (INT_ID_GPIO_A*INT_VEC_ENTRY_SZ+64)  // interrupt vector address for GPIO port A
#define INT_ADDR_SPI        (INT_ID_SPI*INT_VEC_ENTRY_SZ+64)    // interrupt vector address for SPI
#define INT_ADDR_BLEB       (INT_ID_BLEB*INT_VEC_ENTRY_SZ+64)    // interrupt vector address for BLEBB
#define INT_ADDR_BLEL       (INT_ID_BLEL*INT_VEC_ENTRY_SZ+64)    // interrupt vector address for BLELLE
#define INT_ADDR_USB        (INT_ID_USB*INT_VEC_ENTRY_SZ+64)     // interrupt vector address for USB
#define INT_ADDR_TMR        (INT_ID_TMR*INT_VEC_ENTRY_SZ+64)    // interrupt vector address for Timer1
#define INT_ADDR_UART       (INT_ID_UART*INT_VEC_ENTRY_SZ+64)   // interrupt vector address for UART
#define INT_ADDR_RTC        (INT_ID_RTC*INT_VEC_ENTRY_SZ+64)     // interrupt vector address for RTC
#define INT_ADDR_CMP        (INT_ID_CMP*INT_VEC_ENTRY_SZ+64)      
#define INT_ADDR_I2C        (INT_ID_I2C*INT_VEC_ENTRY_SZ+64)      
#define INT_ADDR_PWMX       (INT_ID_PWMX*INT_VEC_ENTRY_SZ+64)    // interrupt vector address for PWM1~5
#define INT_ADDR_KEYSCAN    (INT_ID_KEYSCAN*INT_VEC_ENTRY_SZ+64)   // interrupt vector address for KEYSCAN
#define INT_ADDR_ENCODE     (INT_ID_ENCODE*INT_VEC_ENTRY_SZ+64)   // interrupt vector address for ENCODER
#define INT_ADDR_WDOG_BAT   (INT_ID_WDOG_BAT*INT_VEC_ENTRY_SZ+64) // interrupt vector address for Watch-Dog timer and Battery low voltage

